# --------------------------------------- BAD REQUEST ------------------------------------
EMAIL_BAD_REQUEST = "Неверный адрес электронной почты."
PASSWORD_BAD_REQUEST = "Неверный пароль."
USER_BAD_REQUEST = "Пользователь удален."
TOKEN_BAD_REQUEST = "Неверный токен."
# ----------------------------------------------------------------------------------------

# ----------------------------------------- FORBIDDEN ------------------------------------
TOKEN_EXPIRED_FORBIDDEN = ("Срок действия вашего токена истек. "
                           "Пожалуйста, войдите в систему еще раз.")
TOKEN_INVALID_FORBIDDEN = ("Ошибка при расшифровке токена. "
                           "Пожалуйста, проверьте свой запрос.")
TOKEN_REQUIRED_FIELD_FORBIDDEN = ("В вашем токене нет обязательного поля. "
                                  "Пожалуйста, свяжитесь с администратором.")
ROLES_FORBIDDEN = "Для этого действия требуется одна из ролей: ..."
# ----------------------------------------------------------------------------------------
